[
  {"url":"https://uncrate.com/assets_c/2016/02/bugatti-chiron-1-thumb-960xauto-60883.jpg", "name" : "Bugatti Chiron", "speed" : "288 mph", "price" : "$2.6 million", "description": "Someone with even the minutest amount of knowledge about cars would expect a Bugatti on this list. The Chiron was in every way an improvement compared to its predecessor, the Bugatti Veyron, with the top speed of 288 mph. With a speed like that, it easily left the Hennessey Venom GT in the dust, thus, claiming its title as the fastest car in the world. With a price tag of $2.6 Million, it is said to be one of the most amazing feats of engineering in the history of supercars. The Chiron is not only known for its speed, the car also comes with a leather interior. The sound system is in a world of its own, consisting of a diamond diaphragm in every speaker. This isn’t like any other car, unlike other supercars, it doesn’t need to have a professional driver behind the wheel, the machinery adjusts itself at different speed, making it the most unique car ever made.", "likes":"1129", "dislikes":"37"},
  {"url":"https://wallpapercave.com/wp/wp1852556.jpg", "name" : "Koenigsegg Agera R", "speed" : "273 mph", "price" : "£1.1million", "description": "Although, Koenigsegg isn’t a household name in the world of supercars, like Bugatti or Ferrari, it has managed to develop quite a reputation over a short period of time, beating the best supercars in the market. And, the Agera R model is a perfect example of the brand’s might and power that blows all other supercars in the storm with a top speed of over 273 mph, faster than any other supercar you will find on the market today. This is why it’s also known as the fastest car in the world currently. The car comes with a 5-Liter Turbocharged V8 DOHC engine with a compression ratio of 9.0:1 and is capable of generating an impressive 1200 pound-feet of torque and horsepower of 1140, hence enabling the vehicle to zoom from halt to 60 mph within less than 2.5 seconds and reach speeds from 0 to 186 mph within 11.7 seconds (a world record). Available for a price tag of £1.1million, the Agera R is also the first vehicle in the market to feature a dual-clutch transmission in only one-input-shaft. This results in the faster shift times and acceleration, hence making the Agera R one heck of a race car!", "likes":"432", "dislikes":"16"},
  {"url":"https://www.gannett-cdn.com/-mm-/c893c2dccc5d19d6a51a77952cd10641a78b905b/c=0-493-4928-3272&r=x1683&c=3200x1680/local/-/media/USATODAY/USATODAY/2014/02/26//1393454469000-Venom-GT-2704-mph-KSC-9.jpg", "name" : "Henessey Venom", "speed" : "270 mph", "price" : "$1.2 million", "description": "Coming second in the world’s fastest cars category is the Hennessey Venom GT, which is a relatively new name in the industry, but has generated quite a buzz in a short period of time. The car is based on a modified Lotus Exige and has a max speed of 270 mph (just 3 mph less than the Koenigsegg). As a result, the vehicle will terrify anyone upon first glance, as it is purely a beast. Packed with a mighty 7.0 Liter Twin-Turbocharged V8 Engine, the Venom GT is capable of generating an outstanding and dazzling horsepower of 1,244 and torque of 1,155 pound-feet, hence enabling the car to fly from halt to 62 mph within 2.8 seconds only and accelerate from zero to 200 mph in 14.51 seconds (all thanks to the intercooler upgrades and single-clutch shift system to ensure faster shift times). All this power is packaged in an overwhelming and sexy interior and exterior design that can be yours for approximately US $1.2 million. Therefore, the vehicle is relatively cheaper than the Koenigsegg Agera R and delivers a similar performance, only 3 mph less! Which one is the better vehicle? Well, that we can only find out when the two cars RACE!", "likes":"765", "dislikes":"12"},
  {"url":"https://s8096.pcdn.co/wp-content/uploads/2016/10/Veyron-16.4-Super-Sport-Bugatti-1024x617.jpg", "name" : "Bugatti Veyron Super Sport", "speed" : "268 mph", "price" : "€1.6 million", "description": "The Bugatti Veyron held the Guinness World Record for being the fastest supercar in the world for years and was the first ever production car to exceed the 250 mph mark. However, after facing a few technical difficulties, its title was taken over by the Koenigsegg. This is when Bugatti introduced its Super Sport model that has a max speed of 268 mph. 5 mph less than the Koenigsegg, the Bugatti Veyron Super Sport comes equipped with an 8-Liter Quad-Turbo W16 Engine that is capable of generating an impressive torque of 1,106 lb-ft and horsepower 1,200 HP, enabling the car to go from zero to 60 in 2.4 seconds. The best feature of the Super Sport is it makes reaching insane speeds seem effortless. As a result, the vehicle is a breeze to drive and also comfortable and luxurious to sit in, even though it is a supercar. And, this is one of the main reasons why that despite its €1.6 million price tag, the vehicle has been selling well and the demand is high.", "likes":"324", "dislikes":"2"},
  {"url":"http://www.blogcdn.com/www.autoblog.com/media/2007/12/9ff_gt9_001.jpg", "name" : "9ff GT9-R", "speed" : "257 mph", "price" : "€695,000", "description": "Built by the German tuning company, 9ff, the GT9 is a supercar based on the historic Porsche 911. In fact, the looks and exterior styling of the car is also pretty similar to the 911, only with the interior of the car being stripped out for lightness and looks basic as compared to the Porsche. The car is faster than the original Bugatti Veyron, but slower than the SuperSport model. Regardless, the GT9-R is purely a beast on the roads and comes equipped with a rather unique technology. It is fitted and modified with a 4.0-Liter Flat 6 Engine (six cylinders arranged horizontally in two banks of three cylinders) which enables the vehicle to produce an impressive horsepower of 1,120 and torque of 910 lb-ft. This massive engine enables the vehicle to reach top speeds of 257 mph and also gives it the ability speed from zero to 60 mph in just 2.9 seconds, and accelerate from halt to 190 mph in under 16 seconds. The makers of the GT9-R have ensured no two vehicles manufactured are alike and offers potential owners with the option of customizing or personalizing their vehicles to their liking when it comes to design, color, and performance.", "likes":"2135", "dislikes":"14"},
  {"url":"https://i.pinimg.com/originals/f0/f1/e0/f0f1e0b4af1d4a2bd39e4adfa4c8ce5c.jpg", "name" : "SSC Ultimate Aero", "speed" : "256 mph", "price" : " €550,000", "description": "Produced by SSC North America (formerly known as Shelby SuperCars), the SSC Ultimate Aero is a mid-engine sports car that held the title of the world’s fastest production car from Guinness World Records for 3 years (2007 to 2010), till Bugatti introduced the Veyron Super Sport. However, in 2013, the Guinness World Records disqualified the Bugatti Veyron’s record time due to some unknown reasons and reinstated the SSC Aero as the fastest production car ever. However, this change too was reverted five days later. Regardless, for a rather new company in the market, SSC has generated a lot of attention with its Ultimate Aero car. The vehicle comes equipped with a 6.3-Liter Twin-Turbocharged V8 Engine that is capable of generating an impressive horsepower of 1,287 and torque of 1,112 lb-ft. It has a top speed of 256 mph, just 1 mph less than the GT9-R! Nevertheless, with its beast of an engine the vehicle can easily hit 200 mph in under 16 seconds, which is quite reasonable for a car that is available for only €550,000. The only drawback of the vehicle is it doesn’t feature any electronic driver aids to help control the power of the engine.", "likes":"786", "dislikes":"24"},
  {"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Lykan_HyperSport.jpg/1280px-Lykan_HyperSport.jpg", "name" : "Lykan HyperSport", "speed" : "245 mph", "price" : "$3.4 million", "description": "The Lykan Hypersport is a Lebanese limited production supercar built by W Motors, a United Arab Emirates based company, founded in 2012 in Lebanon with the collaboration of Lebanese, French, and Italian engineers. It is the first sports car to be designed and produced indigenously in the Middle East. The production of the car was limited to a planned total of just seven units. The first pre-production Lykan HyperSport was launched at the Qatar Motor Show in February 2013. The manufacturer claims a top speed of 395 km/h (245 mph), depending on the gear ratio setup. The car has claimed acceleration times of 2.8 seconds for 0-100 km/h (0-62 mph) and 9.4 seconds for 0-200 km/h (0-125 mph), though no independent tests have been conducted. There was a demonstration by W Motors in 2013 in Dubai, in which they claim to have recorded the car's performance. In June 2015, the Abu Dhabi police force purchased a Lykan HyperSport. The Abu Dhabi Police car is included in the total of seven, meaning only six will be available for purchase. The Lykan HyperSport is featured in the film Furious 7.", "likes":"3154", "dislikes":"29"},
  {"url":"https://i.redd.it/pt1kt0jeetnz.jpg", "name" : "McLaren F1", "speed" : "241 mph", "price" : "$8.47 million", "description": "Even after 23 years, the McLaren F1 still manages to make the fastest cars’ in the world list. The car has a unique interior design of being a three-seater with the driver’s seat at the center and two passenger seats on the sides. The vehicle is a former champion, but with its center driver’s seat, gold-line engage bay, and carbon-fiber body, it is also one of the coolest cars ever made. Equipped with a 6.1-Liter BMW M V12 engine, the supercar produces 670 Horsepower and peak torque of 520 lb-ft, enabling the vehicle to accelerate from zero to 60 in just 3.2 seconds. The overall design of the vehicle is also impressive and has great aerodynamics to ensure maximum speed and performance. In a period of 6 years, a total of 106 McLaren F1 vehicles were produced. In 2013, chassis number 066 was sold for a record price of US $8.47 million.", "likes":"3245", "dislikes":"44"},
  {"url":"https://s8096.pcdn.co/wp-content/uploads/2016/10/Zenvo-ST1-1024x576.jpg", "name" : "Zenvo ST1", "speed" : "233 mph", "price" : "€660,000", "description": "Manufactured by the Danish company Zenvo, the ST 1 is a high-performance supercar hand-made by a small team of workers. It is the company’s first ever supercar model and was introduced back in 2009. The vehicle easily dishes out a max speed of 233 mph and has the ability to accelerate from zero to 60 mph in a mere 3 seconds. It comes equipped with a 6.8-Liter V8 Engine and generates an impressive horsepower of 1,104 and torque of 1,050 lb-ft, enabling the vehicle to reach 0 to 200 mph in only 8.9 seconds. It also has great features, such as telescopic steering wheel adjustment and a keyless-entry system and is available for a price tag of €660,000.", "likes":"1583", "dislikes":"112"},
  {"url":"https://s8096.pcdn.co/wp-content/uploads/2014/12/Pagani-Huayra.jpg", "name" : "Pagani Huayra", "speed" : "230 mph", "price" : "€1 million", "description": "The Italian supercar manufacturer that has taken the supercar market by storm, Pagani, has developed quite a reputation in a short period of time. The company provides car enthusiasts and adrenaline junkies with top and high-quality cars which not only provide great speed, but also feature unique design cues, earning the title of hyper cars. The Huayra model specifically is known for its amazing and outrageous performance that beats the best racing cars in the market. It isn’t exactly the fastest, but the acceleration is what surprises many car enthusiasts. It comes equipped with a large and power Twin-Turbo V12 6-Liter Engine that can easily produce a whopping 738 lb-ft of torque and 730 horsepower. You can buy it for €900,000 to €1,000,000.", "likes":"1500", "dislikes":"31"},
  {"url":"https://icdn-6.motor1.com/images/mgl/gbwk9/s1/2011-aston-martin-one-77-q-series.jpg", "name" : "Aston Martin One-77", "speed" : "220 mph", "price" : "€1.9 million", "description":"Built by the British Manufacturer Aston Martin, the One-77 is the most extreme and fastest road-going Aston to ever be created. It shares a similar layout with regular Astons you see on the road, but the One-77 is a completely different beast which sports a 7.3-Liter V12 Engine producing 750 HP and 800 lb-ft torque. A total of 77 cars have been produced and apart from its performance, the vehicle is primarily known for its jaw-dropping good looks. The vehicle has a top speed of 220 mph and can easily accelerate from zero to 60 mph in 3.5 seconds.", "likes":"3214", "dislikes":"1245"},
  {"url":"http://ichef.bbci.co.uk/wwfeatures/wm/live/1280_640/images/live/p0/15/xm/p015xm4c.jpg", "name" : "Lamborghini Veneno", "speed" : "220 mph", "price" : "$4.5 million", "description": "The Lamborghini Veneno is a road-legal supercar that is based off of the Aventador LP700-4. The base 6.5- liter V12 powerplant of the Aventador has been upgraded to produce an addition 50 hp over the standard 691 hp found on the LP700-4 for a new power output of 740 hp. The additional power was made possible by the addition of significantly larger air intakes that allow the Veneno to rev much higher. Extensive upgrades and modifications to the exhaust system have also helped to push the total horsepower north. Proudly displaying a top speed of 220 mph, this hypercar remains one of the fastest in its segment. Ultra-quick shifts are made possible by the seven-speed, single-clutch automated ISR transmission that includes a track-ready “Corsa” setting. Both the Veneno and the Aventador share the same permanent 4WD and inboard pushrod suspension. One of the most important features of the Veneno has to be the lightweight design of the carbon fiber frame that creates a power-to-weight ratio of 4.23 CV/lbs. All three examples of the Veneno carried a price tag of approximately $4 million with all three examples being sold before the first was produced.", "likes":"4123", "dislikes":"123"}
]
